In [1]:
import numpy as np
import pandas as pd

In [2]:
tips = pd.read_csv('../examples/tips.csv')

In [3]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [4]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [5]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [6]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [7]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [8]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [9]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [10]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [11]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [12]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [13]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                       'data2': np.random.randn(1000)})
frame.head()

      data1     data2
0 -0.417735 -0.437367
1  0.900477 -0.148377
2 -0.362223 -0.403638
3  2.026893 -1.210843
4  0.478070  0.483690

In [15]:
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0    (-1.533, -0.0139]
1     (-0.0139, 1.506]
2    (-1.533, -0.0139]
3       (1.506, 3.025]
4     (-0.0139, 1.506]
5     (-0.0139, 1.506]
6    (-1.533, -0.0139]
7    (-1.533, -0.0139]
8     (-0.0139, 1.506]
9    (-1.533, -0.0139]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.059, -1.533] < (-1.533, -0.0139] < (-0.0139, 1.506] < (1.506, 3.025]]

In [16]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [17]:
grouped = frame.data2.groupby(quartiles)

In [18]:
grouped.apply(get_stats).unstack()

                   count       max      mean       min
data1
(-3.059, -1.533]    64.0  2.054391 -0.102813 -2.580958
(-1.533, -0.0139]  424.0  2.475404 -0.036084 -2.247773
(-0.0139, 1.506]   446.0  2.641605 -0.034339 -2.497992
(1.506, 3.025]      66.0  1.888025 -0.091953 -1.922727

In [20]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [21]:
grouped = frame.data2.groupby(grouping)

In [22]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.054391 -0.067349 -2.580958
1      100.0  2.232475 -0.093432 -2.138694
2      100.0  2.422521  0.035418 -1.952419
3      100.0  2.215415 -0.030425 -2.247773
4      100.0  2.475404 -0.148904 -2.361155
5      100.0  2.641605  0.088769 -2.363176
6      100.0  2.134977  0.031536 -1.960454
7      100.0  2.412089 -0.185974 -2.497992
8      100.0  2.252722 -0.010431 -2.466644
9      100.0  2.258248 -0.051842 -2.329144

In [23]:
s = pd.Series(np.random.randn(6))

In [24]:
s[::2] = np.nan

In [25]:
s

0         NaN
1    0.338951
2         NaN
3    1.608920
4         NaN
5    0.896494
dtype: float64

In [26]:
s.fillna(s.mean())

0    0.948122
1    0.338951
2    0.948122
3    1.608920
4    0.948122
5    0.896494
dtype: float64

In [27]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [28]:
group_key = ['East'] * 4 + ['West'] * 4
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [29]:
data = pd.Series(np.random.randn(8), index=states)

In [30]:
data

Ohio          0.579077
New York     -0.067703
Vermont       1.423709
Florida       0.025242
Oregon        1.846878
Nevada        1.140435
California   -0.899889
Idaho        -1.988023
dtype: float64

In [31]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.579077
New York     -0.067703
Vermont            NaN
Florida       0.025242
Oregon        1.846878
Nevada             NaN
California   -0.899889
Idaho              NaN
dtype: float64

In [32]:
data.groupby(group_key).mean()

East    0.178872
West    0.473495
dtype: float64

In [33]:
fill_mean = lambda g: g.fillna(g.mean())

In [34]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.579077
New York     -0.067703
Vermont       0.178872
Florida       0.025242
Oregon        1.846878
Nevada        0.473495
California   -0.899889
Idaho         0.473495
dtype: float64

In [35]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [36]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [37]:
def draw(deck,n=5):
    return deck.sample(n)

In [38]:
draw(deck)

2C      2
6H      6
5D      5
10S    10
9C      9
dtype: int64

In [39]:
get_suit = lambda card: card[-1]

In [40]:
deck.groupby(get_suit).apply(draw,n=2)

C  KC    10
   7C     7
D  QD    10
   AD     1
H  AH     1
   9H     9
S  5S     5
   7S     7
dtype: int64

In [41]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

AC      1
KC     10
9D      9
QD     10
4H      4
5H      5
10S    10
9S      9
dtype: int64

In [42]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

  category      data   weights
0        a  0.400353  0.566828
1        a  0.841004  0.123218
2        a -0.123035  0.993631
3        a  0.878097  0.549259
4        b  1.081170  0.905414
5        b  2.763826  0.900917
6        b  0.594019  0.897273
7        b  0.150778  0.137211

In [43]:
grouped = df.groupby('category')

In [44]:
get_wavg = lambda g: np.average(g['data'],weights=g['weights'])

In [45]:
grouped.apply(get_wavg)

category
a    0.309283
b    1.415992
dtype: float64

In [46]:
close_px = pd.read_csv('../examples/stock_px_2.csv',parse_dates=True,
                      index_col=0)

In [47]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [48]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [49]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [50]:
rets = close_px.pct_change().dropna()

In [51]:
get_year = lambda x: x.year

In [52]:
by_year = rets.groupby(get_year)

In [53]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [55]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [56]:
import statsmodels.api as sm

In [57]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

In [58]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514